CSI API ETABS v1
cFrameObj.GetDesignOrientation Method
 Retrieves the design orientation for a given frame object
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetDesignOrientation(
	string Name,
	ref eFrameDesignOrientation DesignOrientation
)
Function GetDesignOrientation (
	Name As String,
	ByRef DesignOrientation As eFrameDesignOrientation
) As Integer
Dim instance As cFrameObj
Dim Name As String
Dim DesignOrientation As eFrameDesignOrientation
Dim returnValue As Integer
returnValue = instance.GetDesignOrientation(Name,
	DesignOrientation)
int GetDesignOrientation(
	String^ Name,
	eFrameDesignOrientation% DesignOrientation
)
abstract GetDesignOrientation :
        Name : string *
        DesignOrientation : eFrameDesignOrientation byref -> int
Parameters
Name
Type: System.String
 The name of the frame object
DesignOrientation
Type: ETABSv1.eFrameDesignOrientation
 A value from the eFrameDesignOrientation enumeration
Return Value
Type: Int32
Remarks
See Also
Reference
cFrameObj Interface
ETABSv1 Namespace